app/controllers/api/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "test"], ["LIMIT", 1]]
---
	def create
		@user = User.find_by(username: user_login_params[:username])