app/controllers/api/bugs_controller.rb

INSERT INTO "bugs" ("bugTitle", "bugDescription", "bugDetails", "bugTags", "bugLineNo", "project_id", "bugId", "bugPriority", "bugDueDate", "bugStatus", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		bug = Bug.new(bug_params)

		if bug.save

UPDATE "bugs" SET "bugDescription" = ?, "bugStatus" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["bugDescription", "This is a really horrible user interface glitch, CSS file is bad"], ["bugStatus", "In Progress"], ["updated_at", "2021-12-15 19:54:45.234212"], ["id", 27]]
---
	def update
		bug = set_bug()


		bug.bugId = params[:bug][:bugId]
		bug.bugTitle = params[:bug][:bugTitle]
		bug.bugDescription = params[:bug][:bugDescription]
		bug.bugDetails = params[:bug][:bugDetails]
		bug.bugTags = params[:bug][:bugTags]
		bug.bugLineNo = params[:bug][:bugLineNo]
		bug.project_id = params[:bug][:project_id]
		bug.bugPriority = params[:bug][:bugPriority]
		bug.bugDueDate = params[:bug][:bugDueDate]
		bug.bugCompletedDate = params[:bug][:bugCompletedDate]
		bug.bugComplete = params[:bug][:bugComplete]
		bug.bugStatus = params[:bug][:bugStatus]

		if bug.save

DELETE FROM "bugs" WHERE "bugs"."id" = ?  [["id", 20]]
---
	def destroy
		bug = set_bug()

		if bug
			bug.delete()

SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
	def set_bug
		Bug.find_by(id: bug_params[:id])