app/controllers/api/projects_controller.rb

INSERT INTO "projects" ("projectTitle", "projectId", "projectDescription", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["projectTitle", "New project"], ["projectId", "BOD6B0"], ["projectDescription", ""], ["user_id", 1], ["created_at", "2021-12-18 00:22:54.743478"], ["updated_at", "2021-12-18 00:22:54.743478"]]
---
	def create
		project = Project.new(project_params)

		if project.save

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 8]]
---
	def destroy
		project = set_project()

		if project
			project.delete()

SELECT "projects".* FROM "projects" WHERE "projects"."projectId" = ? LIMIT ?  [["projectId", "LP8296"], ["LIMIT", 1]]
---
	def set_project
		Project.find_by(projectId: project_params[:projectId])