app/controllers/api/users_controller.rb

	def create
		@user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "display_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)